import random

class randomMsg:
    @staticmethod
    def random_emoji() -> str:
        # 定义一组表情符号，包括更多喜悦的emoji
        emojis = [
            "😀", "😂", "😍", "🤔", "🎉", "🐱", "🍕", "🚀", "🌟", "🌈",
            "🥳", "😄", "😃", "😸", "🎊", "✨", "💕", "🌼", "🍀", "🌺",
            "😊", "🤗", "🥰", "🌸", "🌞", "💖", "🙌", "💐", "🍀", "✨",
            "🦋", "💞", "😇", "🎈", "🌻", "🌷", "🐶", "🌈", "🥳", "❤️",
            "🤩", "🌙", "👑", "🦄", "🌼", "🎀", "🍭", "🎶", "🧸", "💫"
        ]
        # 随机选择一个表情符号
        return random.choice(emojis)
